console.log('=================homework 2.1======================================');
/*------TASK---------------------------------------------------------------*/
console.log('1. Якщо змінна a дорівнює нулю, то виведіть \'Вірно\', інакше виведіть \'Невірно\'. \n' +
    'Перевірте роботу скрипта при a, що дорівнює 1, 0, -3');
/*-----ANSWER---------------------------------------------------------------*/
let number = -1;
if (number  === 0) {
    console.log('Вірно');
} else {
    console.log('Не вірно');
}
console.log('--------ТЕРНАРНИЙ ОПЕРАТОР-----------------------------------------------------------');
number === 0 ? console.log('Вірно') : console.log('Не вірно'); //то саме що if else
/*------TASK---------------------------------------------------------------*/
console.log('2. В змінної min лежить число від 0 до 59. \n' +
    'Визначте в яку чверть години потрапляє це число (в першу, другу, третю або четверту).');
/*-----ANSWER-----if i else----------------------------------------------------------*/
//let min = 15;
let min = Math.round(Math.random()*59);
if (min > 0 && min <= 15){
    console.log('перша чверть години');
}else if (min > 15 && min <= 30){
    console.log('друга чверть години');
}else if (min > 30 && min <= 45){
    console.log('третя чверть години');
}else if (min > 45 && min <= 59){
    console.log('четверта чверть години');
} else {
    console.log('Не має такого значення');
}
// switchом перебрати НЕ ЗМІГ !!!!*!/
/*------TASK---------------------------------------------------------------*/
console.log('3.Якщо змінна a дорівнює або менше 1, а змінна b більше або дорівнює 3, \n' +
    'то виведіть суму цих змінних, \n' +
    'інакше виведіть їх різницю (результат віднімання).\n' +
    ' Перевірте роботу скрипта при a і b, що дорівнює 1 і 3, 0 і 6, 3 і 5.');
/*-----ANSWER---------------------------------------------------------------*/
let a = 3; //дорівнює або менше 1
let b = 5; //більше або дорівнює 3

if (a <= 1 && b >= 3 ){
    console.log(a + b);
} else{
    console.log(a - b);
} // 1 + 3 = 4; 0 + 6 = 6; 3 - 5 = -2;
/*------TASK---------------------------------------------------------------*/
console.log('4. В змінної month лежить якесь число з інтервалу від 1 до 12.\n' +
    'Визначте в яку пору року потрапляє цей місяць (зима, літо, весна, осінь).');
/*-----ANSWER----switch-----------------------------------------------------------*/
//let month = 5;
let  month = Math.round(Math.random() * (12 - 1 ) + 1);
switch (month) {
    case 12:
    case 1:
    case 2:
        console.log('зима');
        break;
    case 6:
    case 7:
    case 8:
        console.log('літо');
        break;
    case 3:
    case 4:
    case 5:
        console.log('весна');
        break;
    case 9:
    case 10:
    case 11:
        console.log('осінь');
        break;
    default:
        console.log('В році 12 місяців!');
}
/*-----ANSWER----if i else-----------------------------------------------------------*/
const month1 = +prompt('Введіть номер місяця.', 'Від 1 до 12');

if ( month1 === 12  || month1 === 1 || month1 === 2) {
    alert('зима');
}

else if ( month1 === 3 || month1 === 4 || month1 === 5) {
    alert('весна');
}

else if ( month1 === 6 || month1 ===  7 || month1 ===   8) {
    alert('літо');
}

else if ( month1 === 9 ||  month1 ===  10 ||  month1 ===  11) {
    alert('осінь');
}else {
    alert('В році 12 місяців!');
}
/*------TASK---------------------------------------------------------------*/
console.log('5. switch\n' +
    'Переменная num может принимать 4 значения: 1, 2, 3 или 4. \n' +
    'Если она имеет значение \'1\', то в переменную result запишем \'зима\', \n' +
    'если имеет значение \'2\' – \'весна\' и так далее.');
/*-----ANSWER----switch case-----------------------------------------------------------*/
let num = 3;
switch (num) {
    case 1:
        console.log('зима');
        break;
    case 2:
        console.log('весна');
        break;
    case 3:
        console.log('літо');
        break;
    case 4:
        console.log('осінь');
        break;
    default:
        console.log('Такого кварталу не існує');
}
/*------TASK---------------------------------------------------------------*/
console.log('6. Переменная num может принимать 12 значений: 1, 2 ..... 12. \n' +
    'Если она имеет значение \'1\', то в переменную result запишем \'январь\', \n' +
    'если имеет значение \'2\' – \'февраль\' и так далее.');
/*-----ANSWER---switch case------------------------------------------------------------*/
//let num2 = 2;
let  num2 = Math.round(Math.random() * (12 - 1 ) + 1);
switch (num2) {
    case 1:
        console.log('январь');
    break;
    case 2:
        console.log('февраль');
    break;
    case 3:
        console.log('март');
    break;
    case 4:
        console.log('апрель');
    break;
    case 5:
        console.log('май');
    break;
    case 6:
        console.log('июнь');
    break;
    case 7:
        console.log('июль');
    break;
    case 8:
        console.log('август');
    break;
    case 9:
        console.log('сентябрь');
    break;
    case 10:
        console.log('октябрь');
    break;
    case 11:
        console.log('ноябрь');
    break;
    case 12:
        console.log('декабрь');
    break;
        default:
        console.log('Такого місяця не існує');
    }
let result2 = num2;
/*-----ANSWER------for---------------------------------------------------------*/
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!






/*------TASK---------------------------------------------------------------*/
//console.log('');
/*-----ANSWER---------------------------------------------------------------*/